// Cette requête KQL est conçue pour détecter les scénarios où les utilisateurs sont trompés pour exécuter des scripts PowerShell malveillants copiés depuis le presse-papiers, comme décrit dans le blog de Proofpoint.
// Références : 
// https://thehackernews.com/2024/12/bitter-apt-targets-turkish-defense.html 
// https://www.proofpoint.com/us/blog/threat-insight/clipboard-compromise-powershell-self-pwn
//
// Étape 1 : Détecter les commandes PowerShell exécutées à partir du presse-papiers par ces utilisateurs non technique
let UserEPPSExec =
DeviceEvents 
| where ActionType == "GetClipboardData" // Commande PowerShell exécutée à partir du presse-papiers
| where InitiatingProcessFileName == "powershell.exe"
| distinct DeviceName;
// Étape 2 : Identifier les commandes PowerShell encodées exécutées sur les appareils utilisés par des utilisateurs non technique
DeviceProcessEvents
| where InitiatingProcessFileName has "powershell.exe" and InitiatingProcessCommandLine has "-EncodedCommand"
| where AccountName != "system" and AccountName != "local service" and AccountName != "administrator"
| where DeviceName has_any(UserEPPSExec) // Appareil utilisé par un utilisateur exécutant une commande PowerShell encodée
//
// MITRE 
// Execution (TA0002) : Les attaquants utilisent des scripts PowerShell pour exécuter du code malveillant
// User Execution (T1204) : Les attaquants comptent sur les actions des utilisateurs, comme copier-coller des scripts malveillants, souvent via des techniques d'ingénierie sociale
// Command and Scripting Interpreter: PowerShell (T1059.001) : Les attaquants abusent des commandes et scripts PowerShell pour exécuter des actions malveillantes
//
